class RorTask1

  #Напишите программу, которая для заданного натурального числа num определяет
  #количество вхождений числа 3 в разложение заданного числа на простые сомножители.
  def how_many_threes num
    #код писать сюда
  end

  #Дан текст. Определите максимальное из имеющихся в нем чисел.
  def max_number_in_text text
    #код писать сюда
  end

  #Дан целочисленный массив. Необходимо вывести вначале его элементы с четными 
  #индексами, а затем - с нечетными.
  def even_odd_elements arr
    #код писать сюда
  end

  #Дан целочисленный массив. Преобразовать его, прибавив к нечетным числам последний 
  #элемент. Первый и последний элементы массива не изменять.
  def even_elements_addition arr
    #код писать сюда
  end

  #Дан целочисленный массив, содержащий по крайней мере два нуля. Вывести сумму чисел 
  #из данного массива, расположенных между первыми двумя нулями.
  def sum_between_zeros arr
    #код писать сюда
  end

end
